Catalogs/ПараметрыRabbit.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>ПараметрыRabbit</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хост</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/КлиентОбменДанными/Ext/Module.bsl
// Получает параметры соединения с брокером из ПараметрыСоединенияGo
//
// Возвращаемое значение:
//   Массив - значения IPХост, Порт, Логин, Токен; 
//
Функция ПолучитьПараметрыСоединенияСGo() Экспорт
	
	Структура = Новый Массив;
   Параметры = Справочники.ПараметрыRabbit; 
   Ссылка = Параметры.НайтиПоРеквизиту("Активный", Истина);
   Если Ссылка = Параметры.ПустаяСсылка() Тогда
	   Сообщить("Не выбрано текущее соединение!")
   Иначе
	Структура.Добавить(Ссылка.Хост);
	Структура.Добавить(Ссылка.Порт);
	Структура.Добавить(Ссылка.Логин); 
	Структура.Добавить(Ссылка.Токен);
	Возврат Структура;
	КонецЕсли;

КонецФункции

Функция ПередачаПоказанийRabbit(Данные,Обменник,RK) Экспорт
	
	Параметры = ПолучитьПараметрыСоединенияСGo();
	Возврат КлиентRabbit.ОтправитьСообщениеКRabbit(Параметры,Обменник, RK,Данные);
		
КонецФункции

Функция ПолучитьПоказанияRabbit(Очередь) Экспорт
	
	Параметры = ПолучитьПараметрыСоединенияСGo();
	Возврат КлиентRabbit.ПолучитьСообщениеRabbit(Параметры,Очередь);
		
КонецФункции
